# Install command-line tools using Homebrew
# Usage: `brew bundle Brewfile`

# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils' # ansible
# Install some other useful utilities like `sponge`
brew 'moreutils' # ansible
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew 'findutils' # ansible

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install other useful binaries
brew 'ant'
brew 'git'  # ansible
brew 'gradle'
brew 'grc'  # ansible
brew 'gti'  # ansible
brew 'maven'
#brew 'python'
brew 'rlwrap'  # ansible
brew 'scala'
brew 'ssh-copy-id'  # ansible
brew 'the_silver_searcher'  # ansible
brew 'tig'  # ansible
brew 'tmux'
brew 'watch' # ansible
brew 'zsh' # make it available: sudo vim /etc/shells  # ansible
#brew 'zsh-syntax-highlighting'
brew 'git-extras'  # ansible
brew 'htop'
brew 'colordiff'
