# Install command-line tools using Homebrew
# Usage: `brew bundle Brewfile`

# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# Install some other useful utilities like `sponge`
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew 'findutils'
# Install GNU `sed`, overwriting the built-in `sed`
#brew 'gnu-sed' --default-names

# Install more recent versions of some OS X tools
# brew 'vim' --override-system-vi
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/screen'

# Install other useful binaries
brew 'ant'
brew 'git'
brew 'gradle'
brew 'grc'
brew 'gti'
#brew 'imagemagick' --with-webp
brew 'maven'
#brew 'python'
brew 'rlwrap'
brew 'scala'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'watch'
brew 'zsh' # make it available: sudo vim /etc/shells
#brew 'zsh-syntax-highlighting'
brew 'git-extras'
brew 'htop'
brew 'colordiff'
